# SQL con Python

## Instalar e importar librerías

In [2]:
# Instalar librerías 

# pip install mysql-connector-python pandas

In [3]:


# Importar librerías

import mysql.connector
import pandas as pd
import random
from datetime import datetime, timedelta

## Inspeccionado un Datawharehouse y sus bases de datos

In [4]:
# Establecer la conexión con la base de datos
conexion = mysql.connector.connect(
    host="127.0.0.1",
    port=3306,
    user="root",
    password="amoaDios1986!"
)

In [5]:
# Crea un cursor para interactuar con la base de datos
cursor = conexion.cursor()

In [6]:
# Consulta para obtener la lista de bases de datos
cursor.execute("SHOW DATABASES")

In [7]:
# Muestra las bases de datos
for base in cursor:
    print(base[0])

Comercio
DCL_Example
DDL_Example
DML_Example
information_schema
Mundo dato
mysql
performance_schema
sakila
sys
TCL_Example
world

In [8]:
# Cierra el cursor y la conexión
cursor.close()
conexion.close()

## Conexión a una base de datos + aplicación de una consulta

In [10]:
# Establece la conexión con la base de datos
conexion = mysql.connector.connect(
    host="127.0.0.1",
    port=3306,
    user="root",
    password="amoaDios1986!",
    database="sakila"  # Especifica la base de datos a la que te quieres conectar
)

# Crea un cursor para interactuar con la base de datos
cursor = conexion.cursor()

# Consulta para obtener la lista de todas las tablas en la base de datos sakila
cursor.execute("SHOW TABLES")

# Muestra las tablas
print("Tablas en la base de datos 'sakila':")
for tabla in cursor:
    print(tabla[0])

Tablas en la base de datos 'sakila':
actor
actor_info
address
category
city
country
customer
customer_list
film
film_actor
film_category
film_list
film_text
inventory
language
nicer_but_slower_film_list
payment
rental
sales_by_film_category
sales_by_store
staff
staff_list
store

In [11]:
# Realiza la consulta y guarda el resultado en un DataFrame
query = "SELECT * FROM city"
df = pd.read_sql(query, conexion)

df.head(10)

/var/folders/12/hygw2v555q7gknf575sn1wn00000gn/T/ipykernel_2532/2027015398.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conexion)

   city_id                  city  country_id         last_update
0        1  A Coruña (La Coruña)          87 2006-02-15 04:45:25
1        2                  Abha          82 2006-02-15 04:45:25
2        3             Abu Dhabi         101 2006-02-15 04:45:25
3        4                 Acuña          60 2006-02-15 04:45:25
4        5                 Adana          97 2006-02-15 04:45:25
5        6           Addis Abeba          31 2006-02-15 04:45:25
6        7                  Aden         107 2006-02-15 04:45:25
7        8                 Adoni          44 2006-02-15 04:45:25
8        9            Ahmadnagar          44 2006-02-15 04:45:25
9       10              Akishima          50 2006-02-15 04:45:25

In [12]:
# Cierra el cursor y la conexión
cursor.close()
conexion.close()

## Creación de base de datos + tablas

In [13]:
# Establece la conexión con la base de datos
conexion = mysql.connector.connect(
    host="127.0.0.1",
    port=3306,
    user="root",
    password="amoaDios1986!"
)

# Crea un cursor para interactuar con la base de datos
cursor = conexion.cursor()

In [16]:
# Crea la base de datos "Mundo dato"
cursor.execute("CREATE DATABASE IF NOT EXISTS `Mundo Data`")

# Selecciona la base de datos "Mundo dato"
cursor.execute("USE `Mundo Data`")

In [17]:
# Crea la tabla Formación
cursor.execute("""
CREATE TABLE IF NOT EXISTS Formación (
    Id INT AUTO_INCREMENT PRIMARY KEY,
    tema VARCHAR(255) NOT NULL,
    horas INT NOT NULL,
    nivel VARCHAR(50) NOT NULL,
    costo DECIMAL(10,2) NOT NULL
)
""")

# Crea la tabla Clientes
cursor.execute("""
CREATE TABLE IF NOT EXISTS Clientes (
    Id INT AUTO_INCREMENT PRIMARY KEY,
    Nombre VARCHAR(255) NOT NULL,
    Ubicación VARCHAR(255) NOT NULL,
    Pago DECIMAL(10,2) NOT NULL,
    Fecha DATE NOT NULL
)
""")

# Crea la tabla Personal
cursor.execute("""
CREATE TABLE IF NOT EXISTS Personal (
    Id INT AUTO_INCREMENT PRIMARY KEY,
    Nombre VARCHAR(255) NOT NULL,
    Apellidos VARCHAR(255) NOT NULL,
    Edad INT NOT NULL,
    Sexo CHAR(1) NOT NULL,
    Fecha_de_nacimiento DATE NOT NULL,
    Salario DECIMAL(10,2) NOT NULL
)
""")

In [18]:
cursor.close()
conexion.close()

# Este código crea la base de datos "Mundo dato" y las tablas "Formación", "Clientes" y "Personal" con las columnas especificadas. 
# Si alguna de las tablas ya existe, el código no la volverá a crear gracias a la cláusula IF NOT EXISTS.

## Insertar  datos a la tabla de una base de datos

In [98]:
# Función para obtener una fecha aleatoria de los últimos 5 años
def random_date():
    start_date = datetime.now() - timedelta(days=5*365)
    random_days = random.randint(0, 5*365)
    return start_date + timedelta(days=random_days)

In [99]:
# Establece la conexión con la base de datos
conexion = mysql.connector.connect(
    host="127.0.0.1",
    port=3306,
    user="root",
    password="amoaDios1986!",
    database="Mundo Data"
)
cursor = conexion.cursor()

In [100]:
# Inserta datos en la tabla Formación
for _ in range(10):
    tema = random.choice(['Programación', 'Diseño Gráfico', 'Marketing', 'Base de Datos', 'Redes'])
    horas = random.randint(5, 60)
    nivel = random.choice(['Básico', 'Intermedio', 'Avanzado'])
    costo = round(random.uniform(50, 300), 2)
    cursor.execute("INSERT INTO Formación (tema, horas, nivel, costo) VALUES (%s, %s, %s, %s)", (tema, horas, nivel, costo))

In [101]:
# Inserta datos en la tabla Clientes
nombres = ['Juan', 'María', 'Carlos', 'Lucía', 'Diego', 'Sofía', 'Miguel', 'Ana', 'Pedro', 'Isabel']
ubicaciones = ['Bogotá', 'Lima', 'Santiago', 'Buenos Aires', 'Ciudad de México']
for nombre in nombres:
    ubicacion = random.choice(ubicaciones)
    pago = round(random.uniform(50, 300), 2)
    fecha = random_date()
    cursor.execute("INSERT INTO Clientes (Nombre, Ubicación, Pago, Fecha) VALUES (%s, %s, %s, %s)", (nombre, ubicacion, pago, fecha))

In [102]:
# Inserta datos en la tabla Personal
apellidos = ['Pérez', 'García', 'Rodríguez', 'Fernández', 'Martínez', 'Guzmán', 'López', 'Torres', 'Gómez', 'Castro']
sexos = ['M', 'F']
for nombre, apellido in zip(nombres, apellidos):
    edad = random.randint(20, 60)
    sexo = random.choice(sexos)
    fecha_nacimiento = random_date()
    salario = round(random.uniform(800, 1500), 2)
    cursor.execute("INSERT INTO Personal (Nombre, Apellidos, Edad, Sexo, Fecha_de_nacimiento, Salario) VALUES (%s, %s, %s, %s, %s, %s)", 
                   (nombre, apellido, edad, sexo, fecha_nacimiento, salario))

In [103]:
# Confirma los cambios y cierra la conexión
conexion.commit()
cursor.close()
conexion.close()

## Insertar  datos a la tabla  de una base de datos a partir de un Dataframe

In [104]:
# Función para obtener una fecha aleatoria de los últimos 50 años
def random_date():
    start_date = datetime.now() - timedelta(days=50*365)
    random_days = random.randint(0, 50*365)
    return (start_date + timedelta(days=random_days)).strftime('%Y-%m-%d')

In [105]:
# Crear DataFrame con datos aleatorios
nombres = ['Juan', 'María', 'Carlos', 'Lucía', 'Diego', 'Sofía', 'Miguel', 'Ana', 'Pedro', 'Isabel', 'Luis', 'Elena', 'Raúl', 'Carmen', 'Manuel', 'Irene']
apellidos = ['Pérez', 'García', 'Rodríguez', 'Fernández', 'Martínez', 'Guzmán', 'López', 'Torres', 'Gómez', 'Castro', 'Morales', 'Ortega', 'Rubio', 'Soto', 'Vargas', 'Zamora']
sexos = ['M', 'F']

data = {
    'Nombre': [random.choice(nombres) for _ in range(30)],
    'Apellidos': [random.choice(apellidos) for _ in range(30)],
    'Edad': [random.randint(20, 60) for _ in range(30)],
    'Sexo': [random.choice(sexos) for _ in range(30)],
    'Fecha_de_nacimiento': [random_date() for _ in range(30)],
    'Salario': [round(random.uniform(800, 1500), 2) for _ in range(30)]
}

df = pd.DataFrame(data)
df

    Nombre  Apellidos  Edad Sexo Fecha_de_nacimiento  Salario
0    Sofía       Soto    60    F          2006-01-08  1062.50
1      Ana  Fernández    57    F          2012-12-29   945.95
2    Sofía     Ortega    31    F          1992-06-05  1496.95
3   Miguel     García    36    F          1983-06-25  1371.19
4    Lucía    Morales    43    M          1983-10-14   864.73
5   Manuel   Martínez    38    F          2004-12-03  1256.46
6   Isabel    Morales    42    F          1979-05-11  1349.61
7     Raúl     García    29    M          1982-07-20  1158.07
8    Diego      López    24    M          2022-04-16  1495.94
9     Juan     Vargas    51    M          2007-03-01   996.68
10   Sofía      Pérez    26    M          2010-12-20   970.25
11   Pedro      Gómez    21    F          2017-03-09  1028.49
12  Carmen     Ortega    53    M          1979-11-14  1209.96
13   Diego   Martínez    20    M          1987-09-28  1037.24
14   Diego      López    59    F          1998-11-14  1224.01
15   Elena     García    43    M          1989-02-13   895.09
16   Lucía     Guzmán    34    F          1994-12-14  1364.87
17   María  Rodríguez    40    F          2000-08-06  1147.48
18   María     Torres    58    M          2017-07-08  1280.75
19   Diego     Guzmán    32    F          1974-10-25  1411.45
20   María     Zamora    47    M          1984-12-31   913.14
21   Sofía     Zamora    55    M          2013-11-12   970.15
22   Sofía      López    30    M          1996-01-01   803.72
23   Pedro     Vargas    30    F          1992-06-13  1293.69
24    Juan     Torres    30    F          2017-07-20  1015.26
25   Sofía    Morales    30    M          2020-06-28  1102.34
26   Lucía      Gómez    51    F          1999-07-07  1033.88
27    Luis     García    46    M          1980-01-14  1168.45
28   Irene       Soto    53    F          1975-07-11   849.23
29   Pedro     Castro    40    M          2003-05-09  1393.78

In [106]:
# Conexión a la base de datos
conexion = mysql.connector.connect(
    host="127.0.0.1",
    port=3306,
    user="root",
    password="amoaDios1986!",
    database="Mundo dato"
)
cursor = conexion.cursor()

In [87]:
try:
    # Intentar insertar el registro en la tabla Personal
    cursor.execute("INSERT INTO Personal (Nombre, Apellidos, Edad, Sexo, Fecha_de_nacimiento, Salario) VALUES (%s, %s, %s, %s, %s, %s)", 
                   (row['Nombre'], row['Apellidos'], row['Edad'], row['Sexo'], row['Fecha_de_nacimiento'], row['Salario']))
    # Confirmar los cambios
    conexion.commit()
    print("Dato insertado exitosamente.")
except mysql.connector.Error as err:
    print(f"Error: {err}")

Dato insertado exitosamente.

In [92]:

    cursor.close()
    conexion.close()

In [90]:
# Establecer la conexión y obtener cursor
# Conexión a la base de datos
conexion = mysql.connector.connect(
    host="127.0.0.1",
    port=3306,
    user="root",
    password="amoaDios1986!",
    database="Mundo dato"
)
cursor = conexion.cursor()

In [107]:

try:
    # Insertar registros del DataFrame en la tabla Personal
    for _, row in df.iterrows():
        # Convertir tipos de datos
        row['Edad'] = int(row['Edad'])
        row['Salario'] = float(row['Salario'])
        
        # Verificar si el nombre y apellido ya existen en la tabla Personal
        cursor.execute("SELECT COUNT(*) FROM Personal WHERE Nombre=%s AND Apellidos=%s", 
                       (row['Nombre'], row['Apellidos']))
        count = cursor.fetchone()[0]
        # Si no existe, insertamos el registro
        if count == 0:
            cursor.execute("INSERT INTO Personal (Nombre, Apellidos, Edad, Sexo, Fecha_de_nacimiento, Salario) VALUES (%s, %s, %s, %s, %s, %s)", 
                           (row['Nombre'], row['Apellidos'], row['Edad'], row['Sexo'], row['Fecha_de_nacimiento'], row['Salario']))
    # Confirmar los cambios
    conexion.commit()
    print("Inserción exitosa.")
except mysql.connector.Error as err:
    print("Error en la inserción:", err)

Inserción exitosa.

In [108]:
try:
    # Consultar la tabla Personal
    cursor.execute("SELECT * FROM Personal")
    results = cursor.fetchall()
    for record in results:
        print(record)
except mysql.connector.Error as err:
    print(f"Error: {err}")

(1, 'Juan', 'Pérez', 37, 'F', datetime.date(2021, 2, 6), Decimal('1083.18'))
(2, 'María', 'García', 28, 'M', datetime.date(2019, 8, 28), Decimal('1180.62'))
(3, 'Carlos', 'Rodríguez', 39, 'F', datetime.date(2021, 5, 15), Decimal('898.34'))
(4, 'Lucía', 'Fernández', 36, 'F', datetime.date(2022, 4, 25), Decimal('1445.65'))
(5, 'Diego', 'Martínez', 38, 'F', datetime.date(2020, 11, 3), Decimal('903.29'))
(6, 'Sofía', 'Guzmán', 51, 'F', datetime.date(2022, 11, 30), Decimal('1326.05'))
(7, 'Miguel', 'López', 45, 'F', datetime.date(2021, 5, 7), Decimal('1099.09'))
(8, 'Ana', 'Torres', 54, 'F', datetime.date(2023, 1, 8), Decimal('1036.24'))
(9, 'Pedro', 'Gómez', 57, 'M', datetime.date(2023, 8, 6), Decimal('1421.60'))
(10, 'Isabel', 'Castro', 30, 'F', datetime.date(2020, 10, 28), Decimal('1325.84'))
(11, 'Sofía', 'Soto', 60, 'F', datetime.date(2006, 1, 8), Decimal('1062.50'))
(12, 'Ana', 'Fernández', 57, 'F', datetime.date(2012, 12, 29), Decimal('945.95'))
(13, 'Sofía', 'Ortega', 31, 'F', datetime.date(1992, 6, 5), Decimal('1496.95'))
(14, 'Miguel', 'García', 36, 'F', datetime.date(1983, 6, 25), Decimal('1371.19'))
(15, 'Lucía', 'Morales', 43, 'M', datetime.date(1983, 10, 14), Decimal('864.73'))
(16, 'Manuel', 'Martínez', 38, 'F', datetime.date(2004, 12, 3), Decimal('1256.46'))
(17, 'Isabel', 'Morales', 42, 'F', datetime.date(1979, 5, 11), Decimal('1349.61'))
(18, 'Raúl', 'García', 29, 'M', datetime.date(1982, 7, 20), Decimal('1158.07'))
(19, 'Diego', 'López', 24, 'M', datetime.date(2022, 4, 16), Decimal('1495.94'))
(20, 'Juan', 'Vargas', 51, 'M', datetime.date(2007, 3, 1), Decimal('996.68'))
(21, 'Sofía', 'Pérez', 26, 'M', datetime.date(2010, 12, 20), Decimal('970.25'))
(22, 'Carmen', 'Ortega', 53, 'M', datetime.date(1979, 11, 14), Decimal('1209.96'))
(23, 'Elena', 'García', 43, 'M', datetime.date(1989, 2, 13), Decimal('895.09'))
(24, 'Lucía', 'Guzmán', 34, 'F', datetime.date(1994, 12, 14), Decimal('1364.87'))
(25, 'María', 'Rodríguez', 40, 'F', datetime.date(2000, 8, 6), Decimal('1147.48'))
(26, 'María', 'Torres', 58, 'M', datetime.date(2017, 7, 8), Decimal('1280.75'))
(27, 'Diego', 'Guzmán', 32, 'F', datetime.date(1974, 10, 25), Decimal('1411.45'))
(28, 'María', 'Zamora', 47, 'M', datetime.date(1984, 12, 31), Decimal('913.14'))
(29, 'Sofía', 'Zamora', 55, 'M', datetime.date(2013, 11, 12), Decimal('970.15'))
(30, 'Sofía', 'López', 30, 'M', datetime.date(1996, 1, 1), Decimal('803.72'))
(31, 'Pedro', 'Vargas', 30, 'F', datetime.date(1992, 6, 13), Decimal('1293.69'))
(32, 'Juan', 'Torres', 30, 'F', datetime.date(2017, 7, 20), Decimal('1015.26'))
(33, 'Sofía', 'Morales', 30, 'M', datetime.date(2020, 6, 28), Decimal('1102.34'))
(34, 'Lucía', 'Gómez', 51, 'F', datetime.date(1999, 7, 7), Decimal('1033.88'))
(35, 'Luis', 'García', 46, 'M', datetime.date(1980, 1, 14), Decimal('1168.45'))
(36, 'Irene', 'Soto', 53, 'F', datetime.date(1975, 7, 11), Decimal('849.23'))
(37, 'Pedro', 'Castro', 40, 'M', datetime.date(2003, 5, 9), Decimal('1393.78'))

In [ ]:
    # Cerrar el cursor y la conexión
    cursor.close()
    conexion.close()

Por qué solo se insertaron 27 casos y lo no los treinta?

Por la logica utilizada de no repetir los casos...

# Verificar si el nombre y apellido ya existen en la tabla Personal
cursor.execute("SELECT COUNT(*) FROM Personal WHERE Nombre=%s AND Apellidos=%s", 
               (row['Nombre'], row['Apellidos']))
count = cursor.fetchone()[0]
# Si no existe, insertamos el registro
if count == 0:
    # Código de inserción

## Uso del commit() para verificar la transacción

In [1]:
# 1. Crear un nuevo DataFrame llamado "Agregar2":

import pandas as pd

# Crear el DataFrame 'Agregar2'
data = {
    'Nombre': ['Carlos', 'Isabel'],
    'Apellidos': ['Ramírez', 'Soto'],
    'Edad': [35, 28],
    'Sexo': ['M', 'F'],
    'Fecha_de_nacimiento': ['1988-05-12', '1995-08-23'],
    'Salario': [1200.50, 1100.75]
}

Agregar2 = pd.DataFrame(data)
Agregar2

   Nombre Apellidos  Edad Sexo Fecha_de_nacimiento  Salario
0  Carlos   Ramírez    35    M          1988-05-12  1200.50
1  Isabel      Soto    28    F          1995-08-23  1100.75

In [4]:
# 2. Conexión a MySQL y tabla "Personal" de "Mundo dato":


# Conexión a la base de datos
conexion = mysql.connector.connect(
    host="127.0.0.1",
    port=3306,
    user="root",
    password="amoaDios1986!",
    database="Mundo dato"
)
cursor = conexion.cursor()

In [5]:
try:
    # Consultar la tabla Personal
    cursor.execute("SELECT * FROM Personal")
    results = cursor.fetchall()
    for record in results:
        print(record)
except mysql.connector.Error as err:
    print(f"Error: {err}")

(1, 'Juan', 'Pérez', 37, 'F', datetime.date(2021, 2, 6), Decimal('1083.18'))
(2, 'María', 'García', 28, 'M', datetime.date(2019, 8, 28), Decimal('1180.62'))
(3, 'Carlos', 'Rodríguez', 39, 'F', datetime.date(2021, 5, 15), Decimal('898.34'))
(4, 'Lucía', 'Fernández', 36, 'F', datetime.date(2022, 4, 25), Decimal('1445.65'))
(5, 'Diego', 'Martínez', 38, 'F', datetime.date(2020, 11, 3), Decimal('903.29'))
(6, 'Sofía', 'Guzmán', 51, 'F', datetime.date(2022, 11, 30), Decimal('1326.05'))
(7, 'Miguel', 'López', 45, 'F', datetime.date(2021, 5, 7), Decimal('1099.09'))
(8, 'Ana', 'Torres', 54, 'F', datetime.date(2023, 1, 8), Decimal('1036.24'))
(9, 'Pedro', 'Gómez', 57, 'M', datetime.date(2023, 8, 6), Decimal('1421.60'))
(10, 'Isabel', 'Castro', 30, 'F', datetime.date(2020, 10, 28), Decimal('1325.84'))
(11, 'Sofía', 'Soto', 60, 'F', datetime.date(2006, 1, 8), Decimal('1062.50'))
(12, 'Ana', 'Fernández', 57, 'F', datetime.date(2012, 12, 29), Decimal('945.95'))
(13, 'Sofía', 'Ortega', 31, 'F', datetime.date(1992, 6, 5), Decimal('1496.95'))
(14, 'Miguel', 'García', 36, 'F', datetime.date(1983, 6, 25), Decimal('1371.19'))
(15, 'Lucía', 'Morales', 43, 'M', datetime.date(1983, 10, 14), Decimal('864.73'))
(16, 'Manuel', 'Martínez', 38, 'F', datetime.date(2004, 12, 3), Decimal('1256.46'))
(17, 'Isabel', 'Morales', 42, 'F', datetime.date(1979, 5, 11), Decimal('1349.61'))
(18, 'Raúl', 'García', 29, 'M', datetime.date(1982, 7, 20), Decimal('1158.07'))
(19, 'Diego', 'López', 24, 'M', datetime.date(2022, 4, 16), Decimal('1495.94'))
(20, 'Juan', 'Vargas', 51, 'M', datetime.date(2007, 3, 1), Decimal('996.68'))
(21, 'Sofía', 'Pérez', 26, 'M', datetime.date(2010, 12, 20), Decimal('970.25'))
(22, 'Carmen', 'Ortega', 53, 'M', datetime.date(1979, 11, 14), Decimal('1209.96'))
(23, 'Elena', 'García', 43, 'M', datetime.date(1989, 2, 13), Decimal('895.09'))
(24, 'Lucía', 'Guzmán', 34, 'F', datetime.date(1994, 12, 14), Decimal('1364.87'))
(25, 'María', 'Rodríguez', 40, 'F', datetime.date(2000, 8, 6), Decimal('1147.48'))
(26, 'María', 'Torres', 58, 'M', datetime.date(2017, 7, 8), Decimal('1280.75'))
(27, 'Diego', 'Guzmán', 32, 'F', datetime.date(1974, 10, 25), Decimal('1411.45'))
(28, 'María', 'Zamora', 47, 'M', datetime.date(1984, 12, 31), Decimal('913.14'))
(29, 'Sofía', 'Zamora', 55, 'M', datetime.date(2013, 11, 12), Decimal('970.15'))
(30, 'Sofía', 'López', 30, 'M', datetime.date(1996, 1, 1), Decimal('803.72'))
(31, 'Pedro', 'Vargas', 30, 'F', datetime.date(1992, 6, 13), Decimal('1293.69'))
(32, 'Juan', 'Torres', 30, 'F', datetime.date(2017, 7, 20), Decimal('1015.26'))
(33, 'Sofía', 'Morales', 30, 'M', datetime.date(2020, 6, 28), Decimal('1102.34'))
(34, 'Lucía', 'Gómez', 51, 'F', datetime.date(1999, 7, 7), Decimal('1033.88'))
(35, 'Luis', 'García', 46, 'M', datetime.date(1980, 1, 14), Decimal('1168.45'))
(36, 'Irene', 'Soto', 53, 'F', datetime.date(1975, 7, 11), Decimal('849.23'))
(37, 'Pedro', 'Castro', 40, 'M', datetime.date(2003, 5, 9), Decimal('1393.78'))
(38, 'Carlos', 'Ramírez', 35, 'M', datetime.date(1988, 5, 12), Decimal('1200.50'))
(39, 'Isabel', 'Soto', 28, 'F', datetime.date(1995, 8, 23), Decimal('1100.75'))
(40, 'Diego', 'Rodríguez', 54, 'F', datetime.date(1984, 10, 15), Decimal('1332.12'))
(41, 'Carlos', 'Torres', 36, 'M', datetime.date(1995, 1, 12), Decimal('930.12'))
(42, 'Diego', 'Ortega', 37, 'F', datetime.date(2010, 2, 6), Decimal('914.78'))
(43, 'Raúl', 'Martínez', 51, 'F', datetime.date(2021, 10, 19), Decimal('1422.16'))
(44, 'Raúl', 'Rodríguez', 28, 'F', datetime.date(1976, 8, 22), Decimal('805.28'))
(45, 'Isabel', 'Guzmán', 21, 'M', datetime.date(2007, 11, 10), Decimal('1497.31'))
(46, 'Elena', 'Morales', 47, 'F', datetime.date(2016, 11, 14), Decimal('1455.64'))
(47, 'Manuel', 'García', 45, 'M', datetime.date(2016, 12, 8), Decimal('1100.06'))
(48, 'María', 'Gómez', 54, 'F', datetime.date(2010, 2, 5), Decimal('1277.49'))
(49, 'Luis', 'Torres', 26, 'M', datetime.date(1989, 1, 1), Decimal('872.05'))
(50, 'Raúl', 'Guzmán', 56, 'M', datetime.date(1991, 10, 24), Decimal('1201.86'))
(51, 'Pedro', 'Ortega', 60, 'M', datetime.date(1978, 11, 12), Decimal('1057.06'))
(52, 'Juan', 'García', 28, 'F', datetime.date(1995, 10, 9), Decimal('943.12'))
(53, 'Ana', 'López', 35, 'M', datetime.date(1991, 6, 29), Decimal('1308.25'))
(54, 'Irene', 'Fernández', 53, 'M', datetime.date(1999, 12, 29), Decimal('1124.09'))
(55, 'Juan', 'Martínez', 51, 'F', datetime.date(1974, 10, 1), Decimal('807.92'))
(56, 'Pedro', 'Guzmán', 33, 'M', datetime.date(1984, 6, 14), Decimal('1142.91'))
(57, 'Raúl', 'Morales', 37, 'M', datetime.date(1991, 7, 2), Decimal('1278.22'))
(58, 'Raúl', 'Zamora', 47, 'M', datetime.date(2006, 10, 5), Decimal('1304.55'))
(59, 'Manuel', 'Rubio', 32, 'F', datetime.date(2010, 5, 26), Decimal('1163.55'))
(60, 'Pedro', 'Zamora', 39, 'F', datetime.date(2000, 3, 3), Decimal('1265.91'))
(61, 'Isabel', 'Rubio', 31, 'M', datetime.date(1997, 1, 20), Decimal('1127.23'))
(62, 'Carlos', 'Ramírez', 35, 'M', datetime.date(1988, 5, 12), Decimal('1200.50'))
(63, 'Isabel', 'Soto', 28, 'F', datetime.date(1995, 8, 23), Decimal('1100.75'))
(64, 'Carlos', 'Ramírez', 35, 'M', datetime.date(1988, 5, 12), Decimal('1200.50'))
(65, 'Isabel', 'Soto', 28, 'F', datetime.date(1995, 8, 23), Decimal('1100.75'))

In [6]:
# 3. Insertar el DataFrame "Agregar2" y usar commit():

# Iterar sobre las filas del DataFrame y insertarlas en la tabla 'Personal'
for index, row in Agregar2.iterrows():
    cursor.execute("INSERT INTO Personal (Nombre, Apellidos, Edad, Sexo, Fecha_de_nacimiento, Salario) VALUES (%s, %s, %s, %s, %s, %s)", 
                   (row['Nombre'], row['Apellidos'], row['Edad'], row['Sexo'], row['Fecha_de_nacimiento'], row['Salario']))

# Usar commit() para asegurar que las transacciones se guarden y reflejen en la base de datos
conexion.commit()

# Cerrar la conexión
cursor.close()
conexion.close()

In [6]:
# Cerrar la conexión
cursor.close()
conexion.close()

A mí no me sirvió de forma inmediata, tuve que cerrar y volver a ver la agregación